/*
 PFAttributeDescriptions.strings
 PFAssistive Framework 3.9.0
 Copyright 2003-2018 Bill Cheeseman. Used by permission.
 All rights reserved.
*/

/* These key-value pairs are used to provide localizable human-readable descriptions for attributes implemented in the accessibility API. This file should be used only for localizable human-readable descriptions in a client application's GUI; it should not be used to provide AppleScript terminology. */

/* This file is localizable. The HIServices subframework of the ApplicationServices framework does not contain a comparable AttributeDescriptions.strings resource, so localizers must provide their own localizations. The attribute descriptions listed below were originally derived from Apple's AXAttributeConstants.h and NSAccessibility.h header files, and they have been checked against Apple's AccessibilityDescriptions.plist file introduced in OS X Mountain Lion 10.8 (but which Apple has not kept up to date). */

/* Starting with PFAssitive Framework 3.8.0, the English descriptions of a UI element's attributes listed below are taken from Apple's Accessibility Inspector 5.0 (AI), first released with Xcode 8 in macOS Sierra 10.12 -- but the PFAssistive Framework does not use initial capitals. Accessibility Inspector includes, in its bundle's Resources folder, several supporting frameworks. One of them, AccessibilityAudit.framework, contains in its en.lproj folder a LocalizableOSX.strings file that contains the English terminology used by the application to name every technical accessibility attribute. Open the LocalizableOSX.strings file in BBEdit or any property list editor to conform UI Browser's PFAttributeDescriptions.strings file to Accessibility Inspector usage. The list below now includes all of the Accessibility Inspector names, including ARIA and other WebKit attributes and some additional attributes that were not previous included in PFAssistive Framework. the list below is all lowercase (except for "UIelements") as before, and it corrects some Apple misspellings. It also ontinues to include a few attributes that are not in the Accessibility Inspector list. */

/* This file includes parameterized attributes. It omits the accessibility attributed string constants in AXTextAttributedString.h and NSAccessibilityConstants.h. */

/* accessibility attribute description */
"AXARIAAtomic" = "ARIA atomic"; /* added 3.8.0 from AI */
"AXARIABusy" = "ARIA busy"; /* added 3.8.0 from AI */
"AXARIACurrent" = "ARIA current"; /* added 3.8.0 from AI */
"AXARIALive" = "ARIA live"; /* added 3.8.0 from AI */
"AXARIARelevant" = "ARIA relevant"; /* added 3.8.0 from AI */
"AXAccessKey" = "access key"; /* added 3.8.0 from AI */
"AXActivationPoint" = "activation point"; /* added 3.8.0 from AI */
"AXAllowedValues" = "allowed values"; /* added 1.4b1 */
"AXAlternateUIVisible" = "alternate UI visible"; /* added 3.4.0; misspelled in AI */
"AXAMPMField" = "AM/PM field"; /* added 1.2b2 */
"AXApplication" = "application"; /* not in AI */
"AXApplicationIsIgnored" = "application is ignored"; /* added 3.8.0 from AI */
"AXAttributedStringForRange" = "attributed string for range"; /* added 1.4b1 */
"AXAuditIssues" = "audit issues"; /* added 3.8.0 from AI */
"AXBlockQuoteLevel" = "block quote level"; /* added 3.8.0 from AI */
"AXBoundsForRange" = "bounds for range"; /* parameterized attribute added 1.2b2; changed from "bounds for character range" 1.3b4 */
"AXCancel" = "cancel"; /* added 3.8.0 from AI */
"AXCancelButton" = "cancel button"; /* added 1.2b2 */
"ACCaretBrowsingEnabled" = "caret browing enabled"; /* added 3.8.0 from AI */
"AXCellForColumnAndRow" = "cell for column and row"; /* parameterized attribute added 3.0b8 */
"AXChildren" = "children";
"AXChildrenInNavigationOrder" = "children in navigation order"; /* added 3.8.0 for High Sierra */
"AXChildrenOrdered" = "children ordered"; /* added 3.8.0 from AI */
"AXClassName" = "class"; /* added 3.8.0 from AI */
"AXClearButton" = "clear button"; /* added 1.2b2; changed from "search clear button" 1.3b4 */
"AXCloseButton" = "close button";
"AXColumnCount" = "column count"; /* added 3.0 */
"AXColumnHeaderUIElements" = "column header UIelements"; /* added 1.4b1; was column header UI elements, changed to column header UIelement in 3.8.0 in AI */
"AXColumnIndexRange" = "column index range"; /* added 3.0b8 */
"AXColumns" = "columns";
"AXColumnTitles" = "column titles";
"AXConfirm" = "confirm"; /* added 3.8.0 from AI */
"AXContainsProtectedContent" = "contains protected content"; /* added 3.3.0b1 for Mavericks */
"AXContents" = "contents";
"AXContentSiblingAbove" = "content sibling above"; /* added 3.8.0 from AI */
"AXContentSiblingBelow" = "content sibling below"; /* added 3.8.0 from AI */
"AXCriticalValue" = "critical value"; /* added 3.0b8; not in AI */
"AXDataDetectorExistAtPoint" = "data detector exist at point"; /* added 3.8.0 from AI */
"AXDateTimeComponents" = "date time components"; /* added 3.8.0 from AI */
"AXDayField" = "day field"; /* added 1.2b2; not in AI */
"AXDecrement" = "decrement"; /* added 3.8.0 from AI */
"AXDecrementButton" = "decrement button";
"AXDelete" = "delete"; /* added 3.8.0 from AI */
"AXDefaultButton" = "default button"; /* added 1.2b2; not in AI */
"AXDescription" = "label"; /* added 1.4b1; was description, changed to label in 3.8.0 in AI */
"AXDidShowDataDetectorMenuAtPoint" = "did show data detector menu at point"; /* added 3.8.0 from AI */
"AXDisclosedByRow" = "disclosed by row"; /* changed to "disclosed by row" 1.2b2 */
"AXDisclosedRows" = "disclosed rows";
"AXDisclosing" = "disclosing";
"AXDisclosureLevel" = "disclosure level"; /* added 1.4b1 */
"AXDocument" = "document";
"AXDOMClassList" = "DOM class list"; /* added 3.8.0 from AI */
"AXDOMIdentifier" = "DOM identifier"; /* added 3.8.0 from AI */
"AXEdited" = "edited";
"AXElementBusy" = "element busy"; /* added 3.4.0 */
"AXEnabled" = "enabled";
"AXEndTextMarker" = "end text marker"; /* added 3.8.0 from AI */
"AXEnhancedUserInterface" = "enhanced user interface"; /* added in 3.1.3; private attribute not publicly declared in NSAccessibility.h */
"AXExpanded" = "expanded";
"AXExpandedTextValue" = "expanded text value"; /* added 3.8.0 from AI; misspelled in AI */
"AXExtrasMenuBar" = "extras menu bar"; /* added 3.2.0 */
"AXFilename" = "filename"; /* was file name, changed to filename in 3.8.0 in AI */
"AXFocused" = "keyboard focused"; /* was focused, change to keyboard focused in 3.8.0 in AI */
"AXFocusedApplication" = "focused application";
"AXFocusedUIElement" = "focused UIelement"; /* was focused UI element, changed to focused UIelement in 3.8.0 in AI */
"AXFocusedWindow" = "focused window"; /* not in AI */
"AXFrame" = "frame"; /* added 3.5.0 */
"AXFrameInParentCoordinates" = "frame in parent coordinates"; /* added 3.8.0 from AI */
"AXFrontmost" = "frontmost";
"AXFullScreen" = "full screen"; /* added 3.1.3; private attribute not publicly declared in NSAccessibility.h */
"AXFullScreenButton" = "full screen button"; /* added 3.1.3 */
"AXGrowArea" = "grow area";
"AXHandles" = "handles"; /* added 3.0b8 */
"AXHasPopup" = "has popup"; /* added 3.8.0 from AI */
"AXHeader" = "header";
"AXHeaderGroup" = "header group"; /* added 3.8.0 from AI */
"AXHeadingLevel" = "heading level"; /* added 3.8.0 from AI */
"AXHeight" = "height"; /* obsolete but still used in TextEdit until Mac OS X 10.3; not in AI */
"AXHelp" = "help";
"AXHidden" = "hidden";
"AXHorizontalScrollBar" = "horizontal scroll bar";
"AXHorizontalUnitDescription" = "horizontal unit description"; /* added 3.0b8 */
"AXHorizontalUnits" = "horizontal units"; /* added 3.0b8 */
"AXHourField" = "hour field"; /* added 1.2b2 */
"AXIdentifier" = "identifier"; /* added 3.1.3 */
"AXIncrement" = "increment"; /* added 3.8.0 from AI */
"AXIncrementButton" = "increment button";
"AXIncrementor" = "incrementor"; /* added 1.2b2; not in AI */
"AXIndex" = "index"; /* added 1.4b1 */
"AXInsertionPointLineNumber" = "insertion point line number"; /* added 1.4b1 */
"AXInvalid" = "invalid"; /* added 3.8.0 from AI */
"AXIsApplicationRunning" = "is application running"; /* added 1.4b1 */
"AXIsEditable" = "is editable"; /* marked obsolete in AXConstants.h; changed from editable 1.3b4 */
"AXIsIgnored" = "ignored"; /* added 3.8.0 from AI */
"AXLabelUIElements" = "label UIelements"; /* added 1.4b1; was label UI element, changed to label UIelements in 3.8.0 in AI */
"AXLabelValue" = "label value"; /* added 1.4b1 */
"AXLanguage" = "language"; /* added 3.8.0 from AI */
"AXLanguageText" = "language text"; /* added 3.8.0 from AI */
"AXLayoutCount" = "layout count"; /* added 3.8.0 from AI */
"AXLayoutPointForScreenPoint" = "layout point for screen point"; /* parameterized attribute added 3.0b8 */
"AXLayoutSizeForScreenSize" = "layout size for screen size"; /* parameterized attribute added 3.0b8 */
"AXLineForIndex" = "line for index"; /* parameterized attribute added 1.2b2; changed from "line index for character index" 1.3b4 */
"AXLinkUIElements" = "link UIelements"; /* added 3.8.0 from AI */
"AXLinkedUIElements" = "linked UIelements"; /* added 1.4b1, was linked UI elements, changed to linked UIelements in 3.8.0 in AI */
"AXLoadingProgress" = "loading progress"; /* added 3.8.0 from AI */
"AXMain" = "main";
"AXMainWindow" = "main window";
"AXMakeScreenRectVisible" = "make screen rect visible"; /* added 3.8.0 from AI */
"AXMarkedMisspelledText" = "marked misspelled text"; /* added 3.8.0 from AI */
"AXMarkerGroupUIElement" = "marker group UIelement"; /* added 1.4b1; was marker group UI element, changed to marker group UIelement in 3.8.0 in AI */
"AXMarkerType" = "marker type"; /* added 1.4b1 */
"AXMarkerTypeDescription" = "marker type description"; /* added 1.4b1 */
"AXMarkerUIElements" = "marker UIelements"; /* added 1.4b1; was marker UI elements, changed to marker UIelement in 3.8.0 in AI */
"AXMarkerValues" = "marker values"; /* added 1.4b1 */
"AXMatteContentUIElement" = "matte content UI element"; /* added 1.4b1 */ /* deprecated in OS X Yosemite 10.10; not in AI */
"AXMatteHole" = "matte hole"; /* added 1.4b1 */ /* deprecated in OS X Yosemite 10.10; not in AI */
"AXMaxValue" = "max value"; /* added " value" 1.2b2 to match AppleScript usage; changed from "maximum" to "max" 1.4b5 to preserve alphabetical ordering */
"AXMenuBar" = "menu bar";
"AXMenuItemCmdChar" = "menu item command character"; /* not in AI */
"AXMenuItemCmdGlyph" = "menu item command glyph"; /* not in AI */
"AXMenuItemCmdModifiers" = "menu item command modifiers"; /* not in AI */
"AXMenuItemCmdVirtualKey" = "menu item command virtual key"; /* change from "menu item command key" 1.3b4; not in AI */
"AXMenuItemMarkChar" = "menu item mark character"; /* not in AI */
"AXMenuItemPrimaryUIElement" = "menu item primary UI element"; /* added 1.4b4; not in AI */
"AXMinimizeButton" = "minimize button";
"AXMinimized" = "minimized"; /* removed window 1.2b2 */
"AXMinuteField" = "minute field"; /* added 1.2b2; not in AI */
"AXMinValue" = "min value"; /* added " value" 1.2b2 to match AppleScript usage; changed from "minimum" to "min" 1.4b5 to preserve alphabetical ordering */
"AXModal" = "modal"; /* added 1.2b2; not in AI */
"AXMonthField" = "month field"; /* added 1.2b2; not in AI */
"AXNextContents" = "next contents";
"AXNextContentSibling" = "next content sibling"; /* added 3.8.0 from AI */
"AXNumberOfCharacters" = "number of characters"; /* added 1.2b2 */
"AXOrderedByRow" = "ordered by row"; /* added 3.0; misspelled in AI */
"AXOrientation" = "orientation";
"AXOverflowButton" = "overflow button";
"AXOwns" = "owns"; /* added 3.8.0 from AI */
"AXPageIndex" = "page index"; /* added 3.8.0 from AI */
"AXPageIndexDescription" = "page index description"; /* added 3.8.0 from AI */
"AXParent" = "parent";
"AXPath" = "path"; /* added 3.8.0 from AI */
"AXPick" = "pick"; /* added 3.8.0 from AI */
"AXPlaceholderStyle" = "placeholder style"; /* added 3.8.0 from AI */
"AXPlaceholderValue" = "placeholder value"; /* added 3.0b8 */
"AXPosition" = "position";
"AXPress" = "press"; /* added 3.8.0 from AI */
"AXPreventKeyboardDOMEventDispatch" = "prevent keyboard DOM event dispatch"; /* added 3.8.0 from AI */
"AXPreviousContentSibling" = "previous content sibling"; /* added 3.8.0 from AI */
"AXPreviousContents" = "previous contents";
"AXProxy" = "proxy"; /* was proxy icon, changed to proxy in 3.8.0 in AI */
"AXRaise" = "raise"; /* added 3.8.0 from AI */
"AXRangeForIndex" = "range for index"; /* parameterized attribute added 1.2b2; changed from "character range for glyph at character index" 1.3b4 */
"AXRangeForLine" = "range for line"; /* parameterized attribute added 1.2b2; changed from "character range for line index" 1.3b4 */
"AXRangeForPosition" = "range for position"; /* parameterized attribute added 1.2b2; changed from "character range for glyph at position" 1.3b4 */
"AXRequired" = "required"; /* added 3.7 for Sierra */
"AXRole" = "role";
"AXRoleDescription" = "type"; /* changed from description to role description 1.3b4; changed to type in 3.8.0 in AI */
"AXRowCount" = "row count"; /* added 3.0 */
"AXRowHeader" = "row header"; /* added 3.8.0 from AI */
"AXRowHeaderUIElements" = "row header UIelements"; /* added 3.0b8; was row header UI elements, changed to row header UIelements in 3.8.0 in AI */
"AXRowIndexRange" = "row index range"; /* added 3.0b8 */
"AXRows" = "rows";
"AXRTFForRange" = "RTF for range"; /* parameterized attribute added 1.2b2; changed from "RTF data for character range" 1.3b4; misspelled in AI */
"AXScreenPointForLayoutPoint" = "screen point for layout point"; /* parameterized attribute added 3.0b8 */
"AXScreenSizeForLayoutSize" = "screen size for layout size"; /* parameterized attribute added 3.0b8 */
"AXSearchButton" = "search button"; /* added 1.2b2 */
"AXSearchMenu" = "search menu"; /* added 1.2b2 */
"AXSecondField" = "second field"; /* added 1.2b2; not in AI */
"AXSections" = "sections"; /* added 3.7.0 for El Capitan */
"AXSelected" = "selected";
"AXSelectedCells" = "selected cells"; /* added 3.0b8 */
"AXSelectedChildren" = "selected children";
"AXSelectedColumns" = "selected columns";
"AXSelectedRows" = "selected rows";
"AXSelectedText" = "selected text";
"AXSelectedTextMarkerRange" = "selected text marker range"; /* added 3.8.0 from AI */
"AXSelectedTextRange" = "selected text range";
"AXSelectedTextRanges" = "selected text ranges"; /* added 3.0 */
"AXServesAsTitleForUIElements" = "serves as title for UIelements"; /* added 1.4b1; was serves as title for UI elements, changed to serves as title for UIelements in 3.8.0 in AI */
"AXSharedCharacterRange" = "shared character range"; /* added 1.2b2; changed from "character range in element" 1.3b4 */
"AXSharedFocusElements" = "shared focus UIelements"; /* added 3.4.0; was shared focus elements, changed to shared focus UIelements in 3.8.0 in AI */
"AXSharedTextUIElements" = "shared text UIelements"; /* added 1.2b2; changed from elements sharing text 1.3b4; changed to shared text UIelements in 3.8.0 in AI */
"AXShowAlternateUI" = "show alternate UI"; /* added 3.8.0 from AI */
"AXShowDefaultUI" = "show default UI"; /* added 3.8.0 from AI */
"AXShowMenu" = "show menut"; /* added 3.8.0 from AI */
"AXShownMenu" = "shown menu"; /* added 3.8.0 from AI */
"AXShownMenuUIElement" = "shown menu UI element"; /* added 1.4b1; not in AI */
"AXSize" = "size";
"AXSortDirection" = "sort direction";
"AXSplitters" = "splitters";
"AXStartTextMarker" = "start text marker"; /* added 3.8.0 from AI */
"AXStringForRange" = "string for range"; /* parameterized attribute added 1.2b2; changed from "substring for character range" 1.3b4 */
"AXStyleInfo" = "style info"; /* added 3.8.0 from AI */
"AXStyleRangeForIndex" = "style range for index"; /* parameterized attribute added 1.2b2; changed from "style range for character index" 1.3b4 */
"AXSubrole" = "subrole";
"AXTabs" = "tabs";
"AXText" = "text"; /* not in AI */
"AXTextInputMarkedRange" = "text input marked range"; /*added 3.1.3; private attribute not publicly declared in NSAccessibility.h */
"AXTitle" = "title";
"AXTitleUIElement" = "title UIelement"; /* was title UI element, changed to title UIelement in 3.8.0 in AI */
"AXToolbarButton" = "toolbar button"; /* removed space 1.2b2 */
"AXTopLevelUIElement" = "top level UIelement"; /* added 1.4b1; was top level UI element, changed to top level UIelement in 3.8.0 in AI */
"AXTotalPages" = "total pages"; /* added 3.8.0 from AI */
"AXTotalPagesDescription" = "total pages description"; /* added 3.8.0 from AI */
"AXUnitDescription" = "unit description"; /* added 1.4b1 */
"AXUnits" = "units"; /* added 1.4b1 */
"AXUntouchable" = "untouchable"; /* added 3.8.0 from AI */
"AXURL" = "URL"; /* added 1.2b2 */
"AXValue" = "value";
"AXValueDescription" = "value description"; /* added 3.0 */
"AXValueIncrement" = "value increment"; /* not in AI */
"AXValueWraps" = "value wraps"; /* not in AI */
"AXVerticalScrollBar" = "vertical scroll bar";
"AXVerticalUnitDescription" = "vertical unit description"; /* added 3.0b8 */
"AXVerticalUnits" = "vertical units"; /* added 3.0b8 */
"AXVisibleCells" = "visible cells"; /* added 3.0b8 */
"AXVisibleCharacterRange" = "visible character range"; /* added 1.2b2; changed from "character range for visible lines" 1.3b4 */
"AXVisibleCharacterTextMarkerRange" = "visible character text marker range"; /* added 3.8.0 from AI */
"AXVisibleChildren" = "visible children";
"AXVisibleColumns" = "visible columns";
"AXVisibleRows" = "visible rows";
"AXVisibleText" = "visible text"; /* added 1.2b2; not in AI */
"AXVisited" = "visited"; /* added 3.8.0 from AI */
"AXWarningValue" = "warning value"; /* added 3.0b8 */
"AXWidth" = "width"; /* obsolete but still used by TextEdit until Mac OS X 10.3; not in AI */
"AXWindow" = "window";
"AXWindows" = "windows";
"AXYearField" = "year field"; /* added 1.2b2; not in AI */
"AXZoomButton" = "zoom button";
